//Семинар 1
//Задание 3. Вывести на экран рисунок из букв

#include <stdio.h>

int main(void)
{
    printf("    *\n");
    printf("   ***\n");
    printf("  *****\n");
    printf(" *******\n");
    printf("  HH HH\n");
    printf("  ZZZZZ\n");
    return 0; 
}