//Семинар 1
//Задание 2. Вывести на экран текст "лесенкой"

#include <stdio.h>

int main(void)
{
    printf("Let's\n");
    printf("\tgo\n");
    printf("\t \t to walk\n");
    return 0;
}